{
  "simulation_equations": [
    "p(i) = 1 / (1 + exp(-sqrt(iter(i))))",
    "PN_p(i) = ks_i + sum(j in Gamma(i)) p(j)",
    "PN_n(i) = sum(j in Gamma(i)) sum(l in Gamma(j)) k_l",
    "r_1j = PN_p(j) / sum(j=1 to n) PN_p(j)",
    "r_2j = PN_n(j) / sum(j=1 to n) PN_n(j)",
    "H_1 = -1 / ln(n) * sum(j=1 to n) r_1j * ln(r_1j)",
    "H_2 = -1 / ln(n) * sum(j=1 to n) r_2j * ln(r_2j)",
    "w_1 = (1 - H_1) / (2 - (H_1 + H_2))",
    "w_2 = (1 - H_2) / (2 - (H_1 + H_2))",
    "PN(i) = w_1 * PN_p(i) + w_2 * PN_n(i)",
    "tau = (nc - nd) / (0.5 * n * (n - 1))",
    "epsilon(p) = 1 - (sum(i in phi_m(p)) F_i(tc) / sum(j in phi_s(p)) F_j(tc))",
    "SIR: dS/dt = -beta * S * I / N, dI/dt = beta * S * I / N - gamma * I, dR/dt = gamma * I"
  ],
  "constants_required": [
    {
      "name": "beta",
      "description": "Infection rate in SIR model",
      "value_or_range": "[0.1, 0.5] typical range for network simulations"
    },
    {
      "name": "gamma",
      "description": "Recovery rate in SIR model",
      "value_or_range": "0.1 (fixed, as per typical SIR simulations)"
    },
    {
      "name": "tc",
      "description": "Critical time point for measuring final influence in SIR model",
      "value_or_range": "Time when infection stabilizes (typically 50-100 time steps)"
    },
    {
      "name": "p",
      "description": "Proportion of top-ranked nodes to compare",
      "value_or_range": "[0.01, 0.10] representing 1% to 10% of nodes"
    }
  ],
  "variables_to_vary": [
    {
      "name": "network_topology",
      "description": "Type of complex network to test",
      "range": "['scale_free', 'small_world', 'random', 'real_world']",
      "units": "categorical"
    },
    {
      "name": "network_size",
      "description": "Number of nodes in the network",
      "range": "[100, 500, 1000, 2000]",
      "units": "nodes"
    },
    {
      "name": "ranking_method",
      "description": "Node ranking method to compare",
      "range": "['k_shell_only', 'k_shell_first_order', 'proposed_PN']",
      "units": "categorical"
    },
    {
      "name": "initial_infected_node",
      "description": "Node selected as initial spreader in SIR model",
      "range": "All nodes in network (for comprehensive evaluation)",
      "units": "node_id"
    }
  ],
  "procedure_steps": [
    "Step 1: Generate or load complex networks with different topologies (scale-free using Barabási-Albert model with m=3, small-world using Watts-Strogatz with k=6 and p=0.3, random Erdős-Rényi with p=0.05, and real-world networks if available)",
    "Step 2: For each network, perform k-shell decomposition to obtain ks_i for all nodes and record iter(i) for each node during the decomposition process",
    "Step 3: Implement baseline method 1 (k-shell only): rank nodes by ks_i values directly",
    "Step 4: Implement baseline method 2 (k-shell with first-order neighbors): compute C_nc(i) = sum(j in Gamma(i)) ks(j) and rank by ks_i + C_nc(i)",
    "Step 5: Implement proposed method: (a) compute position index p(i) using sigmoid function, (b) compute position attribute PN_p(i) = ks_i + sum(j in Gamma(i)) p(j), (c) compute neighbor attribute PN_n(i) = sum(j in Gamma(i)) sum(l in Gamma(j)) k_l, (d) normalize to get r_1j and r_2j, (e) compute information entropy H_1 and H_2, (f) compute weights w_1 and w_2, (g) compute final score PN(i) = w_1 * PN_p(i) + w_2 * PN_n(i)",
    "Step 6: For each ranking method, obtain ranked list of nodes from highest to lowest influence score",
    "Step 7: Run SIR model simulations: (a) for each node i in the network, initialize it as the sole infected node (I=1, S=n-1, R=0), (b) simulate SIR dynamics using discrete-time updates with beta in [0.1, 0.5] and gamma=0.1, (c) record final influence F_i(tc) as the total number of recovered nodes at time tc when infection stabilizes, (d) repeat for all nodes to get ground truth ranking based on actual propagation capability",
    "Step 8: Compute Kendall's tau correlation: (a) for each ranking method, compare its node ranking with SIR-based ground truth ranking, (b) count concordant pairs (nc) where both rankings agree on order, (c) count discordant pairs (nd) where rankings disagree, (d) compute tau = (nc - nd) / (0.5 * n * (n - 1))",
    "Step 9: Compute imprecision function epsilon(p): (a) select top p% nodes according to each ranking method (phi_m(p)), (b) select top p% nodes according to SIR ground truth (phi_s(p)), (c) compute epsilon(p) = 1 - (sum(i in phi_m(p)) F_i(tc) / sum(j in phi_s(p)) F_j(tc)), (d) vary p from 1% to 10%",
    "Step 10: Repeat steps 1-9 for all network topologies and sizes, averaging results over multiple network instances (at least 10 per configuration) and multiple SIR runs with different beta values",
    "Step 11: Statistical analysis: perform paired t-tests or Wilcoxon signed-rank tests to determine if differences in Kendall's tau between methods are statistically significant",
    "Step 12: Generate visualizations: (a) bar plots comparing average Kendall's tau across methods for each network type, (b) line plots showing epsilon(p) vs p for different methods, (c) heatmaps showing tau values across network types and sizes, (d) box plots showing distribution of tau values across multiple runs"
  ],
  "expected_outcomes": "The simulation should reveal that the proposed PN method achieves significantly higher Kendall's tau correlation coefficients (closer to 1.0) with SIR model propagation outcomes compared to both baseline methods across all network topologies. Specifically: (1) k-shell only method should show moderate correlation (tau approximately 0.4-0.6) as it captures basic structural importance but lacks refinement, (2) k-shell with first-order neighbors should show improved correlation (tau approximately 0.6-0.75) by incorporating immediate neighborhood information, (3) proposed PN method should show highest correlation (tau approximately 0.8-0.95) by combining sigmoid-transformed iterative information, second-order neighbor degrees, and entropy-based weighting. The imprecision function epsilon(p) should be lowest for the proposed method across all values of p, indicating better identification of truly influential nodes. The improvement should be most pronounced in scale-free and small-world networks where hierarchical structure and position relative to network core are critical. Results should be consistent across different network sizes, with statistical significance (p < 0.05) confirmed through hypothesis testing. Visualization should clearly demonstrate the superiority of the multi-attribute entropy-weighted approach over simpler methods."
}