{
  "summary": "This paper proposes an improved method for ranking influential nodes in complex networks by integrating multiple attributes and using information entropy weighting. The method enhances the traditional k-shell decomposition by incorporating iterative information processed through a sigmoid function and combining shell values with position and neighbor attributes. The effectiveness of the proposed method is validated through experimental simulations using the SIR model and various evaluation measures.",
  "formulas": [
    "km_i = kr_i + \\lambda * ke_i",
    "\\theta(i) = ks_max - ks_i + 1 / sum(j \\in S_c) d_ij",
    "\\delta_i = ks_i * (1 + iter(i) / m)",
    "IC_i = \\delta_i * d_i + sum(j \\in \\Gamma(i)) (\\delta_j * d_j)",
    "C_nc(i) = sum(j \\in \\Gamma(i)) ks(j)",
    "C_nc+(i) = sum(j \\in \\Gamma(i)) C_nc(j)",
    "p(i) = 1 / (1 + e^{-sqrt(iter(i))})",
    "PN_p(i) = ks_i + sum(j \\in \\Gamma(i)) p(j)",
    "PN_n(i) = sum(j \\in \\Gamma(i)) sum(l \\in \\Gamma(j)) k_l",
    "PN(i) = w_1 * PN_p(i) + w_2 * PN_n(i)",
    "H_i = -1 / ln(n) * sum(j=1 to n) r_ij * ln(r_ij)",
    "r_1j = PN_p(j) / sum(j=1 to n) PN_p(j), r_2j = PN_n(j) / sum(j=1 to n) PN_n(j)",
    "w_i = 1 - H_i / (2 - sum(i) H_i)",
    "\\tau = (nc - nd) / (0.5 * n * (n - 1))",
    "\\epsilon(p) = 1 - (sum(i \\in \\phi_m(p)) F_i(tc) / sum(j \\in \\phi_s(p)) F_j(tc))"
  ],
  "relationships": [
    "The position index p(i) increases as the number of iterations increases, indicating a node's closeness to the network core.",
    "The position attribute PN_p(i) combines the shell value and the position index to reflect a node's overall network position.",
    "The neighbor attribute PN_n(i) aggregates the degrees of second-order neighbors to assess the influence spread capability of a node.",
    "The final influence score PN(i) is a weighted combination of position and neighbor attributes, using information entropy for weighting.",
    "The propagation capability of nodes is evaluated using the SIR model, with the influence of nodes assessed through various centrality measures."
  ],
  "variables": [
    "km_i: Mixed degree of node i",
    "kr_i: Residual degree of node i",
    "ke_i: Depletion degree of node i",
    "\\lambda: Adjustable parameter for mixed degree decomposition",
    "ks_i: Shell value of node i",
    "ks_max: Maximum shell value in the network",
    "S_c: Set of core nodes with maximum ks value",
    "d_ij: Shortest path distance between node i and node j",
    "iter(i): Number of iterations node i is involved in during decomposition",
    "m: Total number of iterations in K-shell decomposition",
    "d_i: Degree of node i",
    "\\Gamma(i): Set of neighbors of node i",
    "p(i): Position index of node i",
    "PN_p(i): Position attribute of node i",
    "PN_n(i): Neighbor attribute of node i",
    "w_1, w_2: Weights for position and neighbor attributes",
    "H_i: Entropy of attribute i",
    "r_ij: Normalized value of attribute i for node j",
    "nc, nd: Number of concordant and discordant pairs",
    "n: Total number of nodes",
    "\\tau: Kendall's coefficient",
    "\\epsilon(p): Imprecision function",
    "F_i(tc): Final influence of node i",
    "\\phi_m(p), \\phi_s(p): Sets of top-ranked nodes by method m and SIR model"
  ],
  "key_ideas": [
    "Improvement of the k-shell method by integrating multiple attributes and iterative information.",
    "Use of a sigmoid function to process iteration information for determining node position indices.",
    "Combination of position and neighbor attributes weighted by information entropy to rank node influence.",
    "Validation of the proposed method through experimental simulations using the SIR model and evaluation measures like Kendall coefficient and imprecision function."
  ]
}