{
  "summary": "This paper proposes an improved multiattribute k-shell method for ranking influential nodes in complex networks using information entropy weighting. The method enhances the traditional k-shell decomposition by incorporating iterative information processed through a sigmoid function to determine node position indices and combines this with neighbor attributes for a more nuanced node influence assessment.",
  "formulas": [
    "km_i = kr_i + \\lambda ke_i",
    "\\theta(i) = ks_{max} - ks_i + 1 \\sum_{j \\in S} cd_{ij}",
    "\\delta_i = ks_i * (1 + \\frac{iter(i)}{m})",
    "IC_i = \\delta_i * d_i + \\sum_{j \\in \\Gamma(i)} \\delta_j * d_j",
    "C_nc(i) = \\sum_{j \\in \\Gamma(i)} ks(j)",
    "C_nc^+(i) = \\sum_{j \\in \\Gamma(i)} C_nc(j)",
    "p(i) = \\frac{1}{1 + e^{-\\sqrt{iter(i)}}}",
    "PN_p(i) = ks_i + \\sum_{j \\in \\Gamma(i)} p(j)",
    "PN_n(i) = \\sum_{j \\in \\Gamma(i)} \\sum_{l \\in \\Gamma(j)} k_l",
    "PN(i) = w_1 * PN_p(i) + w_2 * PN_n(i)",
    "H_i = -\\frac{1}{\\ln n} \\sum_{j=1}^n r_{ij} \\ln r_{ij}",
    "r_{1j} = \\frac{PN_p(j)}{\\sum_{j=1}^n PN_p(j)}, r_{2j} = \\frac{PN_n(j)}{\\sum_{j=1}^n PN_n(j)}",
    "w_i = \\frac{1 - H_i}{2 - \\sum_i H_i}"
  ],
  "relationships": [
    "The node's influence is quantified by combining local neighborhood information with global iteration data.",
    "The position index p(i) is derived from the number of iterations iter(i) using a sigmoid function, reflecting the node's proximity to the network core.",
    "The position attribute PN_p(i) and neighbor attribute PN_n(i) are combined using weights derived from information entropy to form the overall influence score PN(i).",
    "The influence of nodes is evaluated through their propagation capability using the SIR model, and the effectiveness of the ranking method is measured by Kendall's coefficient and imprecision function."
  ],
  "variables": [
    "km_i: Mixed degree of node i",
    "kr_i: Residual degree of node i",
    "ke_i: Depletion degree of node i",
    "\\lambda: Adjustable parameter between 0 and 1",
    "ks_i: Shell value of node i",
    "ks_{max}: Maximum shell value in the network",
    "S: Set of core nodes in the network",
    "cd_{ij}: Shortest path distance between node i and node j",
    "iter(i): Number of iterations node i is involved in during decomposition",
    "m: Total number of iterations in K-shell decomposition",
    "d_i: Degree of node i",
    "\\Gamma(i): Set of neighbors of node i",
    "p(i): Position index of node i",
    "PN_p(i): Position attribute of node i",
    "PN_n(i): Neighbor attribute of node i",
    "PN(i): Combined influence score of node i",
    "H_i: Entropy of attribute i",
    "r_{ij}: Normalized value of attribute i for node j",
    "w_i: Weight for attribute i"
  ],
  "key_ideas": [
    "Introduction of an improved multiattribute k-shell method that integrates iterative information with node attributes to rank influential nodes.",
    "Use of a sigmoid function to process iteration information for determining node position indices.",
    "Combination of position and neighbor attributes weighted by information entropy to enhance node influence assessment.",
    "Evaluation of the proposed method's effectiveness using the SIR model and statistical measures like Kendall's coefficient and imprecision function."
  ]
}